## Introduction

This is a notebook I use to learn more about Pandas. As such, I try to follow a basic path, as creating a data frame, describing the data and other steps. Some of the examples come from my work on data, and some wrangling I had to do to analyze and create models.

In [1]:
# Step 0. Load libraries
import pandas as pd
import numpy as np

### 1.1 Creating a dataframe

Pandas has many methods fo creating a new dataframe object. One easy method is to create an empty dataframe and then define each column separately.

In [2]:
# Create an empty data frame object
df = pd.DataFrame()

In [3]:
# Then create each column, and add elements using lists
df['id'] = [1,2,3,4,5,6]
df['call_id'] = [200,200,200,300,300,300]
df['result'] = ['answering machine','call back','call back',\
               'still workable','transfer call','do not call']
df['code_result'] = ['am','cb','cb','sw','tc','dc']

In [4]:
# Let's print the dataframe
df

   id  call_id             result code_result
0   1      200  answering machine          am
1   2      200          call back          cb
2   3      200          call back          cb
3   4      300     still workable          sw
4   5      300      transfer call          tc
5   6      300        do not call          dc

### 1.2 Describing the data

We want to view some characteristics of a dataframe, like the mean, standard deviation and count of elements

In [5]:
# Let's load a dataset, from UCI
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/00267/data_banknote_authentication.txt'
# This dataset comes without header
df = pd.read_csv(url, sep = ',', header = None, \
                 names=['varWav','skeWav','curtWav','entropy','class'])

This dataset comes from UCI Data Banknote Authentication dataset, and the data was extracted from images that were taken for the evaluation of an authentication procedure for banknotes. Wavelet Transform tool were used to extract features from images [1]. The features (and type) are:

1. variance of Wavelet Transformed image (continuous) 
2. skewness of Wavelet Transformed image (continuous) 
3. curtosis of Wavelet Transformed image (continuous) 
4. entropy of image (continuous) 
5. class (integer)

In [6]:
# Let's look how is the dataset, the head, tail and dimensions
df

       varWav    skeWav  curtWav  entropy  class
0     3.62160   8.66610  -2.8073 -0.44699      0
1     4.54590   8.16740  -2.4586 -1.46210      0
2     3.86600  -2.63830   1.9242  0.10645      0
3     3.45660   9.52280  -4.0112 -3.59440      0
4     0.32924  -4.45520   4.5718 -0.98880      0
...       ...       ...      ...      ...    ...
1367  0.40614   1.34920  -1.4501 -0.55949      1
1368 -1.38870  -4.87730   6.4774  0.34179      1
1369 -3.75030 -13.45860  17.5932 -2.77710      1
1370 -3.56370  -8.38270  12.3930 -1.28230      1
1371 -2.54190  -0.65804   2.6842  1.19520      1

[1372 rows x 5 columns]

In [7]:
# Now let's see the statistics
df.describe()

            varWav       skeWav      curtWav      entropy        class
count  1372.000000  1372.000000  1372.000000  1372.000000  1372.000000
mean      0.433735     1.922353     1.397627    -1.191657     0.444606
std       2.842763     5.869047     4.310030     2.101013     0.497103
min      -7.042100   -13.773100    -5.286100    -8.548200     0.000000
25%      -1.773000    -1.708200    -1.574975    -2.413450     0.000000
50%       0.496180     2.319650     0.616630    -0.586650     0.000000
75%       2.821475     6.814625     3.179250     0.394810     1.000000
max       6.824800    12.951600    17.927400     2.449500     1.000000

We need to be cautious because pandas treats the column 'class' as numeric, because it contains 1s and 0s, but in this case the numerical values represent categories.

### 3.3 Navigating dataframes

Sometimes we need to select individual data or slices of a dataframe.

In [8]:
# Let's select the first row
df.iloc[0]

varWav     3.62160
skeWav     8.66610
curtWav   -2.80730
entropy   -0.44699
class      0.00000
Name: 0, dtype: float64

In [9]:
# Now let's select three rows
df.iloc[0:3]

   varWav  skeWav  curtWav  entropy  class
0  3.6216  8.6661  -2.8073 -0.44699      0
1  4.5459  8.1674  -2.4586 -1.46210      0
2  3.8660 -2.6383   1.9242  0.10645      0

In [10]:
# We can index our dataset, for example by class
df = df.set_index(df['class'])

### 1.4 Selecting rows based on conditionals

In [11]:
# Let's read the Titanic Dataset
url = 'https://raw.githubusercontent.com/chrisalbon/kaggle/master/titanic/data/train.csv'
df_tc = pd.read_csv(url)
df_tc

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
# Let's filter by sex "female", and show only the first two rows
df_tc[df_tc['Sex']=='female'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

We have created a condition, that the column 'Sex' must be equal to 'female'. After that, we call the method head and specify we want only two columns.

In [13]:
# Now let's filter by sex 'female' and passengers over 60
df_tc[(df_tc['Sex']=='female') & (df_tc['Age']>=60)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

Note that for two or more conditions, we need to enclose them in parenthesis.

### 1.5 Replacing values

### 2. References

[1] UCI Machine Learning Repository. (May 22, 2021). Banknote Authentication Dataset. Retrieved from https://archive.ics.uci.edu/ml/datasets/banknote+authentication